tests/TestData/StripeWebhook/ApiResponse/bt_list_success.json

{
  "object": "list",
  "data": [
    {
      "id": "txn_1H4Rt9KkGuKkxwBNtVRZeh4v",
      "object": "balance_transaction",
      "amount": 700,
      "available_on": 1595203200,
      "created": 1594647611,
      "currency": "gbp",
      "description": null,
      "exchange_rate": null,
      "fee": 30,
      "fee_details": [
        {
          "amount": 30,
          "application": null,
          "currency": "gbp",
          "description": "Stripe processing fees",
          "type": "stripe_fee"
        }
      ],
      "net": 670,
      "reporting_category": "charge",
      "source": "ch_externalId_123",
      "status": "available",
      "type": "payment"
    }
  ],
  "has_more": false,
  "url": "/v1/balance_transactions"
}
